org/_refs/stianandersen2018.org
#+TITLE: stianandersen2018 | Dual-quaternion backstepping control for a fully-actuated rigid-body
#+CREATED: [2021-10-07 Thu 16:10]
#+LAST_MODIFIED: [2021-10-07 Thu 16:22]
#+ROAM_KEY: cite:stianandersen2018
#+ROAM_TAGS: 

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.

* Info
:PROPERTIES:
:ID: stianandersen2018
:DOCUMENT_PATH: ../../../Zotero/storage/BEU5V85E/Stian Andersen et al. - 2018 - Dual-quaternion backstepping control for a fully-a.pdf
:TYPE: Inproceedings
:AUTHOR: Stian Andersen, T., Johansen, T., & Kristiansen, R.
:YEAR: 2018
:JOURNAL: 
:DOI:  http://dx.doi.org/10.23919/ACC.2018.8431719
:URL: ---
:KEYWORDS: ---
:END:
:ABSTRACT:
In this paper dual-quaternions are used to model a fully actuated rigid-body. A backstepping-controller that solves the trajectory tracking problem is derived and proved to provide uniform asymptotical stabilization of the error dynamics. Numerical simulations are provided where the controller is compared to existing dual-quaternion tracking controllers and it is shown to have similar performance.
:END:

* Notes
:PROPERTIES:
:NOTER_DOCUMENT: ../../../Zotero/storage/BEU5V85E/Stian Andersen et al. - 2018 - Dual-quaternion backstepping control for a fully-a.pdf
:NOTER_PAGE: [[pdf:/Users/guto/Sync/Projetos/Zotero/storage/BEU5V85E/Stian Andersen et al. - 2018 - Dual-quaternion backstepping control for a fully-a.pdf::1]]
:END:

** Resumo
:PROPERTIES:
:NOTER_PAGE: [[pdf:~/Sync/Projetos/Zotero/storage/BEU5V85E/Stian Andersen et al. - 2018 - Dual-quaternion backstepping control for a fully-a.pdf::1++0.00;;annot-1-0]]
:ID:       ../../../Zotero/storage/BEU5V85E/Stian Andersen et al. - 2018 - Dual-quaternion backstepping control for a fully-a.pdf-annot-1-0
:END:

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.
