content/posts/stianandersen2018.md
+++
title = "stianandersen2018 | Dual-quaternion backstepping control for a fully-actuated rigid-body"
author = ["João Gutemberg Farias"]
draft = false
+++

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.


## Info {#info}

In this paper dual-quaternions are used to model a fully actuated rigid-body. A backstepping-controller that solves the trajectory tracking problem is derived and proved to provide uniform asymptotical stabilization of the error dynamics. Numerical simulations are provided where the controller is compared to existing dual-quaternion tracking controllers and it is shown to have similar performance.


## Notes {#notes}


### Resumo {#resumo}

The work proposes a Backstepping controller for a fully actuated rigid-body using Dual Quaternions. The controller is proved to be asymptotically stable using Lyapunov.
